src/InformationRegisters/дкл_ПользователиСкладов/дкл_ПользователиСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_ПользователиСкладов</name>
  <resources>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроверятьАвторизациюНаАСХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Роль</name>
    <type>
      <types>EnumRef.дкл_РолиПользователей</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </resources>
  <resources>
    <name>УправлениеЧерез1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>active_</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>firstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>lastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>login</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>middleName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>position</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remotePassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remoteAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remoteLogin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>rfid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>role</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>userId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/дкл_РолиПользователей/дкл_РолиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дкл_РолиПользователей</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/дкл_ПользователиСкладов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("НастройкаСклада") Тогда
		НастройкаСклада = Параметры.Отбор.НастройкаСклада;	
		Использование = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "НастройкаСклада", НастройкаСклада, ВидСравненияКомпоновкиДанных.Равно,,Использование);
	КонецЕсли;
	
	ОтображениеСкрытыхПользователей = Истина;               
	ОтобразитьСкрытыхПользователейНажатиеНаСервере(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтобразитьСкрытыхПользователейНажатие(Элемент)
	ОтобразитьСкрытыхПользователейНажатиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВАСХ(Команда) 
	
	ОтправитьВАСХНаСервере();  
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователя(Команда)
	УдалитьПользователейНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокНаСервере()     
	
	Если Список.Отбор.Элементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаСклада = Список.Отбор.Элементы[0].ПравоеЗначение;

	Если НЕ ТипЗнч(НастройкаСклада) = Тип("СправочникСсылка.дкл_НастройкиСкладовЛифтов") Тогда
		Возврат;	
	КонецЕсли;	
	
	Результат = дкл_ОбменДаннымиСервер.ПолучитьСписокПользователей(НастройкаСклада); 
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") ИЛИ НЕ Результат.Свойство("user") Тогда
		Возврат;	
	КонецЕсли;
	
	Для каждого Стр Из Результат.user Цикл
		
		НаборЗаписей = РегистрыСведений.дкл_ПользователиСкладов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НастройкаСклада.Установить(НастройкаСклада);
		НаборЗаписей.Отбор.userId.Установить(Стр.userId);
		НаборЗаписей.Прочитать();
		Если НЕ НаборЗаписей.Количество() = 0 Тогда
			ТекущаяЗапись = НаборЗаписей[0];
		Иначе
			ТекущаяЗапись = НаборЗаписей.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТекущаяЗапись, Стр, ,"password, remotePassword");
		ТекущаяЗапись.НастройкаСклада = НастройкаСклада;
		ТекущаяЗапись.active_ = Стр.active;                  
		Если Стр.role = "Оператор" ИЛИ ВРег(Стр.role) = "OPERATOR" Тогда
			ТекущаяЗапись.Роль = Перечисления.дкл_РолиПользователей.Оператор;
		ИначеЕсли Стр.role = "Администратор" ИЛИ ВРег(Стр.role) = "ADMIN" Тогда
			ТекущаяЗапись.Роль = Перечисления.дкл_РолиПользователей.Администратор;
		КонецЕсли;               
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеДополнять", Истина);
		НаборЗаписей.Записать();
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОтправитьВАСХНаСервере()
	
	Если Список.Отбор.Элементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаСклада = Список.Отбор.Элементы[0].ПравоеЗначение;
	
	МассивUserId = Новый Массив;
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого Стр Из ВыделенныеСтроки Цикл
		МассивUserId.Добавить(Стр.userId);		
	КонецЦикла;

	дкл_ОбменДаннымиСервер.ВыгрузитьПользователейСклада(
			НастройкаСклада, ,МассивUserId);	
		
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСкрытыхПользователейНажатиеНаСервере() 
	Если ОтображениеСкрытыхПользователей Тогда
		Элементы.ОтобразитьСкрытыхПользователей.Заголовок = "Отобразить неактивных пользователей";
		Использование = Истина;
		ОтображениеСкрытыхПользователей = Ложь;
	Иначе
		Элементы.ОтобразитьСкрытыхПользователей.Заголовок = "Скрыть неактивных пользователей";
		Использование = Ложь;
		ОтображениеСкрытыхПользователей = Истина;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, "active_", Истина, ВидСравненияКомпоновкиДанных.Равно,,Использование);
КонецПроцедуры

&НаСервере
Процедура УдалитьПользователейНаСервере()

	НастройкаСклада = Список.Отбор.Элементы[0].ПравоеЗначение;
	Ответ = дкл_ОбменДаннымиСервер.ПолучитьСписокПользователей(НастройкаСклада); 

	МассивUserId = Новый Массив;
	Для Каждого user Из Ответ.user Цикл
		МассивUserId.Добавить(user.userId)
	КонецЦикла;

	МассивUserIdКУдалению = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		Если МассивUserId.Найти(ВыделеннаяСтрока.userId) = Неопределено Тогда
			МассивUserIdКУдалению.Добавить(ВыделеннаяСтрока.userId);		
		КонецЕсли;		
	КонецЦикла;
	
	Если НЕ МассивUserIdКУдалению.Количество() = 0 Тогда
		РегистрыСведений.дкл_ПользователиСкладов.УдалитьСтроки(НастройкаСклада, МассивUserIdКУдалению);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
